open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_yuv_h264.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_yuv_h264.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 AP typed YUV-buffer/H.264 helper for the immutable v3.1.1.9
 * low-level driver bundle.  NuttX has no generic upper-half matching this
 * line-fed encoder, so the public interface is deliberately synchronous and
 * board-owned.
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <limits.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/spinlock.h>

#include <common/bk_err.h>
#include <driver/dma.h>
#include <driver/h264.h>
#include <driver/yuv_buf.h>

#include <arch/chip/bk7258_yuv_h264.h>
#include "bk7258_media_root.h"

#define BK7258_YUV_H264_DEFAULT_TIMEOUT_MS 5000u
#define BK7258_YUV_H264_MAX_WIDTH          1920u
#define BK7258_YUV_H264_MAX_HEIGHT         1088u
#define BK7258_YUV_H264_LINES_PER_BLOCK    16u
#define BK7258_YUV_H264_PIXEL_BYTES        2u
#define BK7258_YUV_H264_DMA_USER           DMA_DEV_H264
/* This is the v3.1.1.9 H.264 pipeline's repeat-DMA transaction size. */
#define BK7258_YUV_H264_DMA_CHUNK_BYTES    (10u * 1024u)

/* The v3.1.1.9 H.264 driver unconditionally selects CPU2 for group-2 H.264
 * interrupts.  sys_driver.h is not exported by the immutable bundle; these
 * are the minimal exported ABI declarations.  The bit value is from the
 * official BK7258 sys_types.h/sys_reg.h (group-2 position 14).  Disable
 * returns the old enable register rather than an errno/status value. */

extern int32_t sys_drv_core_intr_group2_enable(uint32_t core_id,
                                               uint32_t param);
extern int32_t sys_drv_core_intr_group2_disable(uint32_t core_id,
                                                uint32_t param);

#define BK7258_YUV_H264_CPU1_CORE_ID 1u
#define BK7258_YUV_H264_CPU2_CORE_ID 2u
#define BK7258_YUV_H264_H264_IRQ_BIT (1u << 14)

enum
{
  BK7258_YUV_H264_EVENT_LINE = 1,
  BK7258_YUV_H264_EVENT_FINAL,
  BK7258_YUV_H264_EVENT_ERROR,
};

struct bk7258_yuv_h264_s
{
  mutex_t api_lock;
  spinlock_t state_lock;
  sem_t event_sem;

  uint16_t width;
  uint16_t height;
  enum bk7258_yuv_h264_format_e format;
  FAR uint8_t *line_cache;
  size_t line_cache_size;
  uint32_t timeout_ms;
  uint32_t frame_bytes;
  uint32_t block_bytes;
  uint32_t block_count;

  dma_id_t dma;
  uint32_t fifo_addr;
  bool dma_allocated;
  bool dma_attempted;
  bool dma_ready;
  bool dma_started;
  bool dma_callback_ready;
  bool dma_finish_enabled;

  bool yuv_attempted;
  bool h264_attempted;
  bool yuv_ready;
  bool h264_ready;
  bool h264_route_cpu1;
  bool h264_callback_ready;
  bool yuv_callback_ready;
  bool yuv_started;
  bool h264_enabled;

  bool initialized;
  bool faulted;
  bool operation_active;
  uint32_t pending_lines;
  bool pending_final;
  bool pending_error;
  bool pending_dma_full;
  int callback_error;
  uint32_t completed_blocks;
  uint32_t next_block;
  uint32_t dma_output_capacity;
  uint64_t dma_completed_bytes;
  bool dma_full_seen;
};

static struct bk7258_yuv_h264_s g_bk7258_yuv_h264 =
{
  .api_lock = NXMUTEX_INITIALIZER,
  .state_lock = SP_UNLOCKED,
  .event_sem = SEM_INITIALIZER(0),
  .dma = DMA_ID_MAX,
};

static int bk7258_yuv_h264_sdk_error(bk_err_t error)
{
  switch (error)
    {
      case BK_OK:
        return 0;

      case BK_ERR_PARAM:
      case BK_ERR_NULL_PARAM:
      case BK_ERR_DMA_ID:
      case BK_ERR_DMA_INVALID_ADDR:
      case BK_ERR_DMA_TRANS_LEN:
      case BK_ERR_H264_INVALID_RESOLUTION_TYPE:
      case BK_ERR_H264_INVALID_PIXEL_HEIGHT:
      case BK_ERR_H264_INVALID_CONFIG_PARAM:
        return -EINVAL;

      case BK_ERR_NO_MEM:
        return -ENOMEM;

      case BK_ERR_TIMEOUT:
        return -ETIMEDOUT;

      case BK_ERR_BUSY:
      case BK_ERR_IN_PROGRESS:
        return -EBUSY;

      case BK_ERR_NOT_SUPPORT:
        return -ENOTSUP;

      case BK_ERR_DMA_NOT_INIT:
      case BK_ERR_DMA_ID_NOT_INIT:
      case BK_ERR_YUV_BUF_DRIVER_NOT_INIT:
      case BK_ERR_H264_DRIVER_NOT_INIT:
        return -ENODEV;

      default:
        return -EIO;
    }
}

static int bk7258_yuv_h264_validate_range(FAR const void *data,
                                          size_t length)
{
  uint64_t base;

  if (data == NULL || length == 0)
    {
      return -EINVAL;
    }

  base = (uintptr_t)data;
  if (base > UINT32_MAX || (uint64_t)length - 1 > UINT32_MAX - base)
    {
      return -EOVERFLOW;
    }

  return 0;
}

static bool bk7258_yuv_h264_overlap(FAR const void *left, size_t left_len,
                                    FAR const void *right, size_t right_len)
{
  uint64_t left_start = (uintptr_t)left;
  uint64_t right_start = (uintptr_t)right;
  uint64_t left_end = left_start + left_len;
  uint64_t right_end = right_start + right_len;

  return left_start < right_end && right_start < left_end;
}

static int bk7258_yuv_h264_timeout(uint32_t timeout_ms, FAR clock_t *ticks)
{
  uint64_t value;

  if (ticks == NULL)
    {
      return -EINVAL;
    }

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_YUV_H264_DEFAULT_TIMEOUT_MS;
    }

  value = ((uint64_t)timeout_ms * CLK_TCK + 999) / 1000;
  if (value == 0)
    {
      value = 1;
    }
  if (value > (uint64_t)INT_MAX)
    {
      return -ERANGE;
    }

  *ticks = (clock_t)value;
  return 0;
}

static int bk7258_yuv_h264_route_to_cpu1(void)
{
  int32_t ret;

  (void)sys_drv_core_intr_group2_disable(BK7258_YUV_H264_CPU2_CORE_ID,
                                         BK7258_YUV_H264_H264_IRQ_BIT);
  ret = sys_drv_core_intr_group2_enable(BK7258_YUV_H264_CPU1_CORE_ID,
                                        BK7258_YUV_H264_H264_IRQ_BIT);
  if (ret != 0)
    {
      (void)sys_drv_core_intr_group2_disable(BK7258_YUV_H264_CPU1_CORE_ID,
                                             BK7258_YUV_H264_H264_IRQ_BIT);
      return -EIO;
    }

