open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_yuv_h264.c
  return 0;
}

static void bk7258_yuv_h264_route_from_cpu1(void)
{
  (void)sys_drv_core_intr_group2_disable(BK7258_YUV_H264_CPU1_CORE_ID,
                                         BK7258_YUV_H264_H264_IRQ_BIT);
}

static void bk7258_yuv_h264_event(FAR struct bk7258_yuv_h264_s *priv,
                                  uint32_t event, int error_code)
{
  irqstate_t flags;
  bool post = false;

  if (priv != &g_bk7258_yuv_h264)
    {
      return;
    }

  flags = spin_lock_irqsave(&priv->state_lock);
  if (priv->operation_active)
    {
      switch (event)
        {
          case BK7258_YUV_H264_EVENT_LINE:
            if (priv->pending_lines != UINT32_MAX)
              {
                priv->pending_lines++;
              }
            break;

          case BK7258_YUV_H264_EVENT_FINAL:
            priv->pending_final = true;
            break;

          case BK7258_YUV_H264_EVENT_ERROR:
            if (!priv->pending_error)
              {
                priv->callback_error = error_code < 0 ? error_code : -EIO;
              }
            priv->pending_error = true;
            break;

          default:
            break;
        }
      post = true;
    }
  spin_unlock_irqrestore(&priv->state_lock, flags);

  if (post)
    {
      (void)nxsem_post(&priv->event_sem);
    }
}

static void bk7258_yuv_h264_line_isr(h264_unit_t id, void *param)
{
  (void)id;
  bk7258_yuv_h264_event(param, BK7258_YUV_H264_EVENT_LINE, 0);
}

static void bk7258_yuv_h264_final_isr(h264_unit_t id, void *param)
{
  (void)id;
  bk7258_yuv_h264_event(param, BK7258_YUV_H264_EVENT_FINAL, 0);
}

static void bk7258_yuv_h264_yuv_error_isr(yuv_buf_unit_t id, void *param)
{
  (void)id;
  bk7258_yuv_h264_event(param, BK7258_YUV_H264_EVENT_ERROR, -EIO);
}

static void bk7258_yuv_h264_dma_finish_isr(dma_id_t id)
{
  irqstate_t flags;
  bool post = false;

  (void)id;
  flags = spin_lock_irqsave(&g_bk7258_yuv_h264.state_lock);
  if (g_bk7258_yuv_h264.operation_active)
    {
      /* The destination address loops only at the caller-provided capacity,
       * while each finish interrupt accounts for one complete 10 KiB DMA
       * transaction.  Saturate the arithmetic so a pathological interrupt
       * storm cannot wrap the accounting back below the capacity. */

      if (g_bk7258_yuv_h264.dma_completed_bytes <=
          UINT64_MAX - BK7258_YUV_H264_DMA_CHUNK_BYTES)
        {
          g_bk7258_yuv_h264.dma_completed_bytes +=
            BK7258_YUV_H264_DMA_CHUNK_BYTES;
        }
      else
        {
          g_bk7258_yuv_h264.dma_completed_bytes = UINT64_MAX;
        }

      if (g_bk7258_yuv_h264.dma_output_capacity != 0 &&
          g_bk7258_yuv_h264.dma_completed_bytes >=
          g_bk7258_yuv_h264.dma_output_capacity &&
          !g_bk7258_yuv_h264.pending_dma_full)
        {
          g_bk7258_yuv_h264.pending_dma_full = true;
          g_bk7258_yuv_h264.dma_full_seen = true;
          post = true;
        }
    }
  spin_unlock_irqrestore(&g_bk7258_yuv_h264.state_lock, flags);

  /* Ordinary chunk completion is deliberately not posted.  The H.264 and
   * YUV callbacks drive the line/final state machine; this event is reserved
   * for the first point at which the output capacity is exhausted. */
  if (post)
    {
      (void)nxsem_post(&g_bk7258_yuv_h264.event_sem);
    }
}

static void bk7258_yuv_h264_clear_events(
  FAR struct bk7258_yuv_h264_s *priv)
{
  while (nxsem_trywait(&priv->event_sem) == 0)
    {
    }

  {
    irqstate_t flags = spin_lock_irqsave(&priv->state_lock);
    priv->pending_lines = 0;
    priv->pending_final = false;
    priv->pending_error = false;
    priv->pending_dma_full = false;
    priv->callback_error = 0;
    priv->completed_blocks = 0;
    priv->next_block = 2;
    priv->dma_completed_bytes = 0;
    priv->dma_full_seen = false;
    spin_unlock_irqrestore(&priv->state_lock, flags);
  }
}

static void bk7258_yuv_h264_set_active(
  FAR struct bk7258_yuv_h264_s *priv, bool active)
{
  irqstate_t flags = spin_lock_irqsave(&priv->state_lock);
  priv->operation_active = active;
  spin_unlock_irqrestore(&priv->state_lock, flags);
}

static bool bk7258_yuv_h264_dma_full_seen(
  FAR struct bk7258_yuv_h264_s *priv)
{
  irqstate_t flags;
  bool full;

  flags = spin_lock_irqsave(&priv->state_lock);
  full = priv->dma_full_seen;
  spin_unlock_irqrestore(&priv->state_lock, flags);
  return full;
}

static int bk7258_yuv_h264_dma_setup(
  FAR struct bk7258_yuv_h264_s *priv,
  FAR const struct bk7258_yuv_h264_output_s *output)
{
  dma_config_t dma_config;
  uint32_t max_len;
  uint32_t length;
  uint64_t end;
  bk_err_t sdkret;

  /* A repeat DMA destination must complete whole 10 KiB transactions before
   * it wraps.  This is a deliberate board-helper contract: the output is
   * larger than one DMA transfer in normal H.264 configurations. */

  if (output->capacity > UINT32_MAX ||
      output->capacity < BK7258_YUV_H264_DMA_CHUNK_BYTES ||
      output->capacity % BK7258_YUV_H264_DMA_CHUNK_BYTES != 0)
    {
      return -EINVAL;
    }

  length = BK7258_YUV_H264_DMA_CHUNK_BYTES;

  max_len = bk_dma_get_transfer_len_max(priv->dma);
  if (max_len == 0 || BK7258_YUV_H264_DMA_CHUNK_BYTES > max_len)
    {
      return -E2BIG;
    }

  /* Check the complete caller-owned output range.  The DMA register fields
   * are 32-bit and the destination loop must not wrap outside that range. */

  end = (uint64_t)(uintptr_t)output->data + output->capacity;
  if (end > UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  priv->dma_output_capacity = (uint32_t)output->capacity;
  priv->dma_completed_bytes = 0;

  if (!priv->dma_ready)
    {
      memset(&dma_config, 0, sizeof(dma_config));
      dma_config.mode = DMA_WORK_MODE_REPEAT;
      dma_config.chan_prio = 0;
      dma_config.src.dev = DMA_DEV_H264;
      dma_config.src.width = DMA_DATA_WIDTH_32BITS;
      dma_config.src.addr_inc_en = DMA_ADDR_INC_ENABLE;
      dma_config.src.addr_loop_en = DMA_ADDR_LOOP_ENABLE;
      dma_config.src.start_addr = priv->fifo_addr;
      dma_config.src.end_addr = priv->fifo_addr + 4;
      dma_config.dst.dev = DMA_DEV_DTCM;
      dma_config.dst.width = DMA_DATA_WIDTH_32BITS;
      dma_config.dst.addr_inc_en = DMA_ADDR_INC_ENABLE;
      dma_config.dst.addr_loop_en = DMA_ADDR_LOOP_ENABLE;
      dma_config.dst.start_addr = (uint32_t)(uintptr_t)output->data;
      dma_config.dst.end_addr = (uint32_t)end;

      /* bk_dma_init() performs hardware setup before validating every
       * parameter.  Retain the attempt so a failed call is still paired
       * with bk_dma_deinit() during frame cleanup. */

      priv->dma_attempted = true;
      sdkret = bk_dma_init(priv->dma, &dma_config);
      if (sdkret != BK_OK)
        {
          return bk7258_yuv_h264_sdk_error(sdkret);
        }
      priv->dma_ready = true;
    }
  else
    {
      sdkret = bk_dma_set_dest_addr(priv->dma,
                                    (uint32_t)(uintptr_t)output->data,
                                    (uint32_t)end);
      if (sdkret != BK_OK)
        {
          return bk7258_yuv_h264_sdk_error(sdkret);
        }
    }

