open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_yuv_h264.c
  sdkret = bk_dma_set_transfer_len(priv->dma, length);
  if (sdkret != BK_OK)
    {
      return bk7258_yuv_h264_sdk_error(sdkret);
    }

  sdkret = bk_dma_set_src_burst_len(priv->dma, BURST_LEN_SINGLE);
  if (sdkret != BK_OK)
    {
      return bk7258_yuv_h264_sdk_error(sdkret);
    }

  sdkret = bk_dma_set_dest_burst_len(priv->dma, BURST_LEN_INC16);
  if (sdkret != BK_OK)
    {
      return bk7258_yuv_h264_sdk_error(sdkret);
    }

  sdkret = bk_dma_set_src_sec_attr(priv->dma, DMA_ATTR_SEC);
  if (sdkret != BK_OK)
    {
      return bk7258_yuv_h264_sdk_error(sdkret);
    }

  sdkret = bk_dma_set_dest_sec_attr(priv->dma, DMA_ATTR_SEC);
  if (sdkret != BK_OK)
    {
      return bk7258_yuv_h264_sdk_error(sdkret);
    }

  if (!priv->dma_finish_enabled)
    {
      sdkret = bk_dma_enable_finish_interrupt(priv->dma);
      if (sdkret != BK_OK)
        {
          return bk7258_yuv_h264_sdk_error(sdkret);
        }
      priv->dma_finish_enabled = true;
    }

  return 0;
}

static int bk7258_yuv_h264_dma_stop(
  FAR struct bk7258_yuv_h264_s *priv, bool flush)
{
  int first_error = 0;
  bk_err_t sdkret;

  if (priv->dma_started)
    {
      if (flush)
        {
          sdkret = bk_dma_flush_src_buffer(priv->dma);
          if (sdkret != BK_OK)
            {
              first_error = bk7258_yuv_h264_sdk_error(sdkret);
            }
        }

      sdkret = bk_dma_stop(priv->dma);
      if (sdkret != BK_OK && first_error == 0)
        {
          first_error = bk7258_yuv_h264_sdk_error(sdkret);
        }
      if (sdkret == BK_OK)
        {
          priv->dma_started = false;
        }
    }

  if (priv->dma_finish_enabled)
    {
      sdkret = bk_dma_disable_finish_interrupt(priv->dma);
      if (sdkret != BK_OK && first_error == 0)
        {
          first_error = bk7258_yuv_h264_sdk_error(sdkret);
        }
      if (sdkret == BK_OK)
        {
          priv->dma_finish_enabled = false;
        }
    }

  return first_error;
}

static int bk7258_yuv_h264_stop_frame(
  FAR struct bk7258_yuv_h264_s *priv, bool reset_h264,
  bool account_dma_finish)
{
  int first_error = 0;
  int ret;
  bk_err_t sdkret;

  /* For FINAL_OUT, retain the active state through stop/flush so a finish
   * IRQ already in flight can account its final complete chunk.  Error and
   * timeout paths close the callback window before touching the DMA. */

  if (!account_dma_finish)
    {
      bk7258_yuv_h264_set_active(priv, false);
    }

  ret = bk7258_yuv_h264_dma_stop(priv, true);
  bk7258_yuv_h264_set_active(priv, false);
  if (ret < 0)
    {
      first_error = ret;
    }

  /* The official pipeline resets YUV after every successful frame but
   * keeps H.264 initialized so its GOP state survives.  Error/timeout paths
   * additionally reset H.264 and leave the wrapper faulted until the owner
   * explicitly uninitializes it. */

  if (priv->yuv_ready)
    {
      sdkret = bk_yuv_buf_soft_reset();
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
    }

  if (reset_h264 && priv->h264_ready)
    {
      sdkret = bk_h264_soft_reset();
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
    }

  if (priv->dma_attempted && !priv->dma_ready)
    {
      sdkret = bk_dma_deinit(priv->dma);
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->dma_attempted = false;
          priv->dma_callback_ready = false;
          priv->dma_finish_enabled = false;
        }
    }

  return first_error;
}

static int bk7258_yuv_h264_release_stream(
  FAR struct bk7258_yuv_h264_s *priv)
{
  int first_error = 0;
  int ret;
  bool callbacks_ok;
  bk_err_t sdkret;

  bk7258_yuv_h264_set_active(priv, false);

  /* Stop the DMA consumer before disabling the producers.  The remaining
   * teardown follows the SDK/Tuya ownership dependencies: stop H.264/YUV,
   * remove their callbacks and route, release the stream instances, and only
   * then release the DMA channel configuration. */

  ret = bk7258_yuv_h264_dma_stop(priv, true);
  if (ret < 0)
    {
      first_error = ret;
    }

  if (priv->h264_enabled)
    {
      sdkret = bk_h264_encode_disable();
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->h264_enabled = false;
        }
    }

  if (priv->yuv_started)
    {
      sdkret = bk_yuv_buf_stop(H264_MODE);
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->yuv_started = false;
        }
    }

  if (priv->yuv_ready)
    {
      sdkret = bk_yuv_buf_soft_reset();
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
    }

  if (priv->yuv_callback_ready)
    {
      sdkret = bk_yuv_buf_unregister_isr(YUV_BUF_H264_ERR);
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->yuv_callback_ready = false;
        }
    }

  if (priv->h264_callback_ready)
    {
      callbacks_ok = true;
      sdkret = bk_h264_unregister_isr(H264_LINE_DONE);
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret < 0)
        {
          callbacks_ok = false;
        }

      sdkret = bk_h264_unregister_isr(H264_FINAL_OUT);
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret < 0)
        {
          callbacks_ok = false;
        }
      if (callbacks_ok)
        {
          priv->h264_callback_ready = false;
        }
    }

  if (priv->h264_route_cpu1)
    {
      bk7258_yuv_h264_route_from_cpu1();
      priv->h264_route_cpu1 = false;
    }

  /* The global driver roots are shared by other board media users.  Only
   * release the per-instance YUV/H.264 configuration here; never call the
   * *_driver_deinit roots from this wrapper. */

  if (priv->h264_attempted || priv->h264_ready ||
      priv->h264_callback_ready || priv->h264_enabled)
    {
      sdkret = bk_h264_deinit();
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->h264_attempted = false;
          priv->h264_ready = false;
          priv->h264_callback_ready = false;
          priv->h264_enabled = false;
        }
    }

  if (priv->yuv_attempted || priv->yuv_ready ||
      priv->yuv_callback_ready || priv->yuv_started)
    {
      sdkret = bk_yuv_buf_deinit();
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->yuv_attempted = false;
          priv->yuv_ready = false;
          priv->yuv_callback_ready = false;
          priv->yuv_started = false;
        }
    }

  if (priv->dma_attempted || priv->dma_ready || priv->dma_started ||
      priv->dma_finish_enabled)
    {
      sdkret = bk_dma_deinit(priv->dma);
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->dma_attempted = false;
          priv->dma_ready = false;
          priv->dma_started = false;
          /* bk_dma_deinit() also clears the SDK callback table and resets
           * the channel interrupt state. */
          priv->dma_callback_ready = false;
          priv->dma_finish_enabled = false;
        }
    }

  if (priv->dma_callback_ready)
    {
      sdkret = bk_dma_register_isr(priv->dma, NULL, NULL);
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->dma_callback_ready = false;
        }
    }

  return first_error;
}

static bool bk7258_yuv_h264_resources_owned(
  FAR const struct bk7258_yuv_h264_s *priv)
{
  return priv->dma != DMA_ID_MAX || priv->dma_allocated ||
         priv->dma_attempted || priv->dma_ready || priv->dma_started ||
         priv->dma_callback_ready || priv->dma_finish_enabled ||
         priv->yuv_attempted || priv->yuv_ready ||
         priv->yuv_callback_ready || priv->yuv_started ||
         priv->h264_attempted || priv->h264_ready ||
         priv->h264_route_cpu1 || priv->h264_callback_ready ||
         priv->h264_enabled;
}

