open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_yuv_h264.c
static void bk7258_yuv_h264_reset_owner(
  FAR struct bk7258_yuv_h264_s *priv)
{
  priv->width = 0;
  priv->height = 0;
  priv->format = BK7258_YUV_H264_YUYV;
  priv->line_cache = NULL;
  priv->line_cache_size = 0;
  priv->timeout_ms = 0;
  priv->frame_bytes = 0;
  priv->block_bytes = 0;
  priv->block_count = 0;
  priv->fifo_addr = 0;
  priv->dma = DMA_ID_MAX;
  priv->dma_allocated = false;
  priv->dma_attempted = false;
  priv->dma_ready = false;
  priv->dma_started = false;
  priv->dma_callback_ready = false;
  priv->dma_finish_enabled = false;
  priv->yuv_attempted = false;
  priv->yuv_ready = false;
  priv->yuv_callback_ready = false;
  priv->yuv_started = false;
  priv->h264_attempted = false;
  priv->h264_ready = false;
  priv->h264_route_cpu1 = false;
  priv->h264_callback_ready = false;
  priv->h264_enabled = false;
  priv->dma_output_capacity = 0;
  priv->dma_completed_bytes = 0;
  priv->completed_blocks = 0;
  priv->next_block = 0;
  priv->operation_active = false;
  priv->initialized = false;
  priv->faulted = false;
  bk7258_yuv_h264_clear_events(priv);
}

static int bk7258_yuv_h264_teardown_locked(
  FAR struct bk7258_yuv_h264_s *priv)
{
  int first_error;
  int ret;
  bk_err_t sdkret;

  first_error = bk7258_yuv_h264_release_stream(priv);

  /* A successful deinit detaches all channel state and callbacks.  Only then
   * return the allocation to the SDK pool.  A failed step keeps its ownership
   * bit and DMA id intact so a later uninitialize/initialize can retry rather
   * than overwriting the only record of the live resource. */

  if ((priv->dma_allocated || priv->dma != DMA_ID_MAX) &&
      !priv->dma_attempted && !priv->dma_ready && !priv->dma_started &&
      !priv->dma_callback_ready && !priv->dma_finish_enabled)
    {
      sdkret = bk_dma_free(BK7258_YUV_H264_DMA_USER, priv->dma);
      ret = bk7258_yuv_h264_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->dma_allocated = false;
          priv->dma = DMA_ID_MAX;
        }
    }

  if (bk7258_yuv_h264_resources_owned(priv))
    {
      priv->faulted = true;
      return first_error < 0 ? first_error : -EIO;
    }

  bk7258_yuv_h264_reset_owner(priv);
  return first_error;
}

static int bk7258_yuv_h264_drain_event(
  FAR struct bk7258_yuv_h264_s *priv, FAR bool *line,
  FAR bool *final, FAR bool *error, FAR bool *dma_full,
  FAR int *error_code)
{
  irqstate_t flags;

  *line = false;
  *final = false;
  *error = false;
  *dma_full = false;
  *error_code = 0;

  flags = spin_lock_irqsave(&priv->state_lock);
  if (priv->pending_error)
    {
      priv->pending_error = false;
      *error = true;
      *error_code = priv->callback_error;
    }
  else if (priv->pending_final)
    {
      priv->pending_final = false;
      *final = true;
    }
  else if (priv->pending_dma_full)
    {
      priv->pending_dma_full = false;
      *dma_full = true;
    }
  else if (priv->pending_lines != 0)
    {
      priv->pending_lines--;
      *line = true;
    }
  spin_unlock_irqrestore(&priv->state_lock, flags);

  return *line || *final || *error || *dma_full ? 0 : -EAGAIN;
}

static int bk7258_yuv_h264_copy_next_block(
  FAR struct bk7258_yuv_h264_s *priv, FAR const uint8_t *input)
{
  uint64_t offset = (uint64_t)priv->next_block * priv->block_bytes;
  FAR uint8_t *slot;

  if (priv->next_block >= priv->block_count)
    {
      return 0;
    }

  slot = priv->line_cache +
    ((priv->next_block & 1u) != 0 ? priv->block_bytes : 0);
  memcpy(slot, input + offset, priv->block_bytes);
  priv->next_block++;
  return 0;
}

static int bk7258_yuv_h264_finish_output(
  FAR struct bk7258_yuv_h264_s *priv,
  FAR struct bk7258_yuv_h264_output_s *output,
  uint32_t encoded)
{
  irqstate_t flags;
  uint64_t completed;
  uint64_t written;
  uint32_t partial;
  uint32_t remain;

  /* dma_stop() leaves the final repeat-DMA remain count available.  A finish
   * interrupt may have completed one or more whole chunks immediately before
   * FINAL_OUT, so combine both observations under the state lock. */

  remain = bk_dma_get_remain_len(priv->dma);
  if (remain > BK7258_YUV_H264_DMA_CHUNK_BYTES)
    {
      return -EIO;
    }

  flags = spin_lock_irqsave(&priv->state_lock);
  completed = priv->dma_completed_bytes;
  spin_unlock_irqrestore(&priv->state_lock, flags);

  partial = BK7258_YUV_H264_DMA_CHUNK_BYTES - remain;
  if (completed > UINT64_MAX - partial)
    {
      return -EOVERFLOW;
    }
  written = completed + partial;

  if (encoded > output->capacity)
    {
      output->length = 0;
      return -ENOSPC;
    }

  if (written > output->capacity)
    {
      output->length = 0;
      return -EIO;
    }

  if (encoded == 0)
    {
      output->length = 0;
      return -EIO;
    }

  /* A final IRQ can race the last DMA finish IRQ.  The missing amount is
   * therefore allowed to be one just-completed chunk, matching the official
   * v3.1.1.9 pipeline's validation rule.  Any other mismatch is a broken
   * FIFO/DMA transaction, not a short output to be hidden. */

  if (written < encoded && encoded - written !=
      BK7258_YUV_H264_DMA_CHUNK_BYTES)
    {
      output->length = 0;
      return -EIO;
    }

  output->length = encoded;
  return 0;
}

static uint32_t bk7258_yuv_h264_encoded_bytes(void)
{
  uint32_t words = bk_h264_get_encode_count();

  if (words > UINT32_MAX / 4u)
    {
      return UINT32_MAX;
    }

  return words << 2;
}

static int bk7258_yuv_h264_init_stream(
  FAR struct bk7258_yuv_h264_s *priv)
{
  yuv_buf_config_t yuv_config;
  int ret;
  bk_err_t sdkret;

  memset(&yuv_config, 0, sizeof(yuv_config));
  yuv_config.work_mode = H264_MODE;
  yuv_config.mclk_div = YUV_MCLK_DIV_4;
  yuv_config.x_pixel = priv->width / 8;
  yuv_config.y_pixel = priv->height / 8;
  yuv_config.yuv_mode_cfg.yuv_format = (yuv_format_t)priv->format;
  yuv_config.yuv_mode_cfg.vsync = SYNC_HIGH_LEVEL;
  yuv_config.yuv_mode_cfg.hsync = SYNC_HIGH_LEVEL;
  /* The official no-sensor pipeline leaves the sensor base empty and sets
   * the encode/read base after H.264 init. */
  yuv_config.base_addr = NULL;
  yuv_config.emr_base_addr = NULL;

