open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_yuv_h264.c
  priv->yuv_attempted = true;
  sdkret = bk_yuv_buf_init(&yuv_config);
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      return ret;
    }
  priv->yuv_ready = true;

  sdkret = bk_yuv_buf_enable_nosensor_encode_mode();
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      return ret;
    }

  priv->h264_attempted = true;
  sdkret = bk_h264_init(priv->width, priv->height);
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      return ret;
    }
  priv->h264_ready = true;

  sdkret = bk_yuv_buf_set_em_base_addr(
    (uint32_t)(uintptr_t)priv->line_cache);
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      return ret;
    }

  sdkret = bk_h264_get_fifo_addr(&priv->fifo_addr);
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_yuv_h264_route_to_cpu1();
  if (ret < 0)
    {
      return ret;
    }
  priv->h264_route_cpu1 = true;

  sdkret = bk_h264_register_isr(H264_LINE_DONE,
                                bk7258_yuv_h264_line_isr, priv);
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      return ret;
    }
  priv->h264_callback_ready = true;

  sdkret = bk_h264_register_isr(H264_FINAL_OUT,
                                bk7258_yuv_h264_final_isr, priv);
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      return ret;
    }

  sdkret = bk_yuv_buf_register_isr(YUV_BUF_H264_ERR,
                                   bk7258_yuv_h264_yuv_error_isr, priv);
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      return ret;
    }
  priv->yuv_callback_ready = true;

  sdkret = bk_yuv_buf_start(H264_MODE);
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      return ret;
    }
  priv->yuv_started = true;

  sdkret = bk_h264_encode_enable();
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      return ret;
    }
  priv->h264_enabled = true;
  return 0;
}

int bk7258_yuv_h264_initialize(
  FAR struct bk7258_yuv_h264_s **out,
  FAR const struct bk7258_yuv_h264_config_s *config)
{
  FAR struct bk7258_yuv_h264_s *priv = &g_bk7258_yuv_h264;
  uint64_t frame_bytes;
  uint64_t block_bytes;
  uint64_t cache_bytes;
  int ret;
  int cleanup_ret;
  bk_err_t sdkret;

  if (out == NULL || config == NULL)
    {
      return -EINVAL;
    }
  *out = NULL;

  if (config->width == 0 || config->height < 32 ||
      config->width > BK7258_YUV_H264_MAX_WIDTH ||
      config->height > BK7258_YUV_H264_MAX_HEIGHT ||
      (config->width & 7u) != 0 ||
      (config->height & (BK7258_YUV_H264_LINES_PER_BLOCK - 1u)) != 0 ||
      config->format > BK7258_YUV_H264_UVYY)
    {
      return -EINVAL;
    }

  frame_bytes = (uint64_t)config->width * config->height *
                BK7258_YUV_H264_PIXEL_BYTES;
  block_bytes = (uint64_t)config->width *
                BK7258_YUV_H264_LINES_PER_BLOCK *
                BK7258_YUV_H264_PIXEL_BYTES;
  cache_bytes = block_bytes * 2;
  if (frame_bytes > UINT32_MAX || block_bytes > UINT32_MAX ||
      cache_bytes > config->line_cache_size ||
      config->line_cache_size == 0 ||
      ((uintptr_t)config->line_cache & 3u) != 0)
    {
      return -EINVAL;
    }

  ret = bk7258_yuv_h264_validate_range(config->line_cache,
                                       config->line_cache_size);
  if (ret < 0)
    {
      return ret;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }
  if (priv->initialized)
    {
      nxmutex_unlock(&priv->api_lock);
      return -EBUSY;
    }

  /* A prior initialize may have failed while its rollback also reported an
   * SDK error.  Never overwrite those ownership flags with a new request.
   * Retry the same teardown first; proceed only when every resource token has
   * actually been released. */

  if (bk7258_yuv_h264_resources_owned(priv))
    {
      cleanup_ret = bk7258_yuv_h264_teardown_locked(priv);
      if (bk7258_yuv_h264_resources_owned(priv))
        {
          nxmutex_unlock(&priv->api_lock);
          return cleanup_ret < 0 ? cleanup_ret : -EIO;
        }
    }

  priv->width = config->width;
  priv->height = config->height;
  priv->format = config->format;
  priv->line_cache = config->line_cache;
  priv->line_cache_size = config->line_cache_size;
  priv->timeout_ms = config->timeout_ms;
  priv->frame_bytes = (uint32_t)frame_bytes;
  priv->block_bytes = (uint32_t)block_bytes;
  priv->block_count = config->height / BK7258_YUV_H264_LINES_PER_BLOCK;
  priv->faulted = false;
  priv->dma = DMA_ID_MAX;
  priv->dma_allocated = false;
  priv->dma_attempted = false;
  priv->dma_ready = false;
  priv->dma_started = false;
  priv->dma_callback_ready = false;
  priv->dma_finish_enabled = false;
  priv->dma_output_capacity = 0;
  priv->dma_completed_bytes = 0;
  priv->dma_full_seen = false;
  priv->yuv_attempted = false;
  priv->h264_attempted = false;
  priv->yuv_ready = false;
  priv->h264_ready = false;
  priv->h264_route_cpu1 = false;
  priv->h264_callback_ready = false;
  priv->yuv_callback_ready = false;
  priv->yuv_started = false;
  priv->h264_enabled = false;
  priv->operation_active = false;
  bk7258_yuv_h264_clear_events(priv);

  ret = bk7258_media_root_initialize(BK7258_MEDIA_ROOT_H264);
  if (ret < 0)
    {
      goto fail;
    }
  priv->dma = bk_dma_alloc(BK7258_YUV_H264_DMA_USER);
  if (priv->dma >= DMA_ID_MAX)
    {
      ret = -EBUSY;
      goto fail;
    }
  priv->dma_allocated = true;

  sdkret = bk_dma_register_isr(priv->dma, NULL,
                               bk7258_yuv_h264_dma_finish_isr);
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      goto fail;
    }
  priv->dma_callback_ready = true;

  ret = bk7258_yuv_h264_init_stream(priv);
  if (ret < 0)
    {
      goto fail;
    }

  priv->initialized = true;
  *out = priv;
  nxmutex_unlock(&priv->api_lock);
  return 0;

fail:
  priv->initialized = false;
  cleanup_ret = bk7258_yuv_h264_teardown_locked(priv);
  if (ret >= 0 && cleanup_ret < 0)
    {
      ret = cleanup_ret;
    }
  nxmutex_unlock(&priv->api_lock);
  return ret;
}

