open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_yuv_h264.c
int bk7258_yuv_h264_uninitialize(FAR struct bk7258_yuv_h264_s *priv)
{
  int ret;

  if (priv != &g_bk7258_yuv_h264)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }
  if (!priv->initialized && !bk7258_yuv_h264_resources_owned(priv))
    {
      nxmutex_unlock(&priv->api_lock);
      return -ENODEV;
    }

  {
    irqstate_t flags = spin_lock_irqsave(&priv->state_lock);
    if (priv->operation_active)
      {
        spin_unlock_irqrestore(&priv->state_lock, flags);
        nxmutex_unlock(&priv->api_lock);
        return -EBUSY;
      }
    spin_unlock_irqrestore(&priv->state_lock, flags);
  }

  ret = bk7258_yuv_h264_teardown_locked(priv);
  nxmutex_unlock(&priv->api_lock);
  return ret;
}

int bk7258_yuv_h264_encode(
  FAR struct bk7258_yuv_h264_s *priv,
  FAR const struct bk7258_yuv_h264_input_s *input,
  FAR struct bk7258_yuv_h264_output_s *output)
{
  clock_t ticks;
  clock_t deadline;
  clock_t now;
  clock_t remaining;
  uint32_t encoded = 0;
  int ret;
  int cleanup_ret;
  bk_err_t sdkret;
  bool line;
  bool final;
  bool error;
  bool dma_full;
  int event_error;

  if (priv != &g_bk7258_yuv_h264 || input == NULL || output == NULL ||
      output->data == NULL)
    {
      return -EINVAL;
    }
  output->length = 0;

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }
  if (!priv->initialized)
    {
      ret = -ENODEV;
      goto out;
    }
  if (priv->faulted)
    {
      ret = -EIO;
      goto out;
    }

  ret = bk7258_yuv_h264_validate_range(input->data, input->length);
  if (ret < 0)
    {
      goto out;
    }
  ret = bk7258_yuv_h264_validate_range(output->data, output->capacity);
  if (ret < 0)
    {
      goto out;
    }
  if (input->length < priv->frame_bytes ||
      bk7258_yuv_h264_overlap(input->data, priv->frame_bytes,
                              priv->line_cache, priv->line_cache_size) ||
      bk7258_yuv_h264_overlap(output->data, output->capacity,
                              input->data, input->length) ||
      bk7258_yuv_h264_overlap(output->data, output->capacity,
                              priv->line_cache, priv->line_cache_size))
    {
      ret = -EINVAL;
      goto out;
    }

  ret = bk7258_yuv_h264_timeout(priv->timeout_ms, &ticks);
  if (ret < 0)
    {
      goto out;
    }

  if (!priv->yuv_ready || !priv->h264_ready || !priv->yuv_started ||
      !priv->h264_enabled)
    {
      ret = -EIO;
      goto out;
    }

  ret = bk7258_yuv_h264_dma_setup(priv, output);
  if (ret < 0)
    {
      goto frame_fail;
    }

  memcpy(priv->line_cache, input->data, priv->block_bytes * 2);
  bk7258_yuv_h264_clear_events(priv);
  bk7258_yuv_h264_set_active(priv, true);

  sdkret = bk_dma_start(priv->dma);
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      goto frame_fail_active;
    }
  priv->dma_started = true;

  sdkret = bk_yuv_buf_rencode_start();
  ret = bk7258_yuv_h264_sdk_error(sdkret);
  if (ret < 0)
    {
      goto frame_fail_active;
    }

  /* The timeout is for the complete frame, not for each line event. */

  deadline = clock_systime_ticks() + ticks;
  for (;;)
    {
      now = clock_systime_ticks();
      remaining = deadline - now;
      if ((int32_t)remaining <= 0)
        {
          ret = bk7258_yuv_h264_dma_full_seen(priv) ? -ENOSPC :
                -ETIMEDOUT;
          goto frame_fail_active;
        }

      ret = nxsem_tickwait_uninterruptible(&priv->event_sem, remaining);
      if (ret < 0)
        {
          if (ret == -ETIMEDOUT &&
              bk7258_yuv_h264_dma_full_seen(priv))
            {
              ret = -ENOSPC;
            }
          goto frame_fail_active;
        }

      if (bk7258_yuv_h264_drain_event(priv, &line, &final, &error,
                                      &dma_full, &event_error) < 0)
        {
          continue;
        }
      if (error)
        {
          ret = event_error < 0 ? event_error : -EIO;
          goto frame_fail_active;
        }
      if (final)
        {
          ret = bk7258_yuv_h264_stop_frame(priv, false, true);
          if (ret < 0)
            {
              priv->faulted = true;
              goto out;
            }
          encoded = bk7258_yuv_h264_encoded_bytes();
          ret = bk7258_yuv_h264_finish_output(priv, output, encoded);
          goto out;
        }
      if (dma_full)
        {
          encoded = bk7258_yuv_h264_encoded_bytes();
          if (encoded > output->capacity)
            {
              ret = -ENOSPC;
              goto frame_fail_active;
            }

          /* Do not let repeat DMA wrap and overwrite a full output while the
           * final H.264 IRQ is racing this notification.  An exact-capacity
           * stream can still publish FINAL_OUT after the DMA is stopped.  If
           * no legal final arrives before the frame deadline, the sticky
           * full state maps that bounded wait to ENOSPC. */

          ret = bk7258_yuv_h264_dma_stop(priv, true);
          if (ret < 0)
            {
              goto frame_fail_active;
            }
        }
      if (line && priv->dma_started)
        {
          priv->completed_blocks++;
          if (priv->completed_blocks < priv->block_count)
            {
              /* This is intentionally rencode-then-copy.  The official
               * pipeline starts the next read before overwriting the slot
               * that the previous line event has just consumed. */

              sdkret = bk_yuv_buf_rencode_start();
              ret = bk7258_yuv_h264_sdk_error(sdkret);
              if (ret < 0)
                {
                  goto frame_fail_active;
                }
              ret = bk7258_yuv_h264_copy_next_block(priv, input->data);
              if (ret < 0)
                {
                  goto frame_fail_active;
                }
            }
        }
    }

frame_fail_active:
  bk7258_yuv_h264_set_active(priv, false);
  priv->faulted = true;
frame_fail:
  priv->faulted = true;
  cleanup_ret = bk7258_yuv_h264_stop_frame(priv, true, false);
  if (ret >= 0 && cleanup_ret < 0)
    {
      ret = cleanup_ret;
    }
  if (ret == -ETIMEDOUT)
    {
      priv->faulted = true;
    }

out:
  nxmutex_unlock(&priv->api_lock);
  return ret;
}
